{
  "storage" : "model.espresso.weights",
  "analyses" : {

  },
  "properties" : {

  },
  "format_version" : 200,
  "metadata_in_weights" : [

  ],
  "layers" : [
    {
      "weights" : {

      },
      "debug_info" : "concatenate_3",
      "top" : "concatenate_3_output",
      "type" : "concat",
      "name" : "concatenate_3",
      "bottom" : "input1,input2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_9",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_9__activation___output",
      "blob_weights" : 3,
      "K" : 5,
      "blob_biases" : 1,
      "name" : "conv2d_9",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "concatenate_3_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "name" : "batch_normalization_9",
      "bottom" : "conv2d_9__activation___output",
      "weights" : {

      },
      "debug_info" : "batch_normalization_9",
      "top" : "batch_normalization_9_output",
      "C" : 64,
      "blob_batchnorm_params" : 5,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_10",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_10__activation___output",
      "blob_weights" : 9,
      "K" : 64,
      "blob_biases" : 7,
      "name" : "conv2d_10",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "batch_normalization_9_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "batch_normalization_10",
      "bottom" : "conv2d_10__activation___output",
      "weights" : {

      },
      "debug_info" : "batch_normalization_10",
      "top" : "batch_normalization_10_output",
      "C" : 32,
      "blob_batchnorm_params" : 11,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_11",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_11__activation___output",
      "blob_weights" : 15,
      "K" : 32,
      "blob_biases" : 13,
      "name" : "conv2d_11",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 16,
      "bottom" : "batch_normalization_10_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "batch_normalization_11",
      "bottom" : "conv2d_11__activation___output",
      "weights" : {

      },
      "debug_info" : "batch_normalization_11",
      "top" : "batch_normalization_11_output",
      "C" : 16,
      "blob_batchnorm_params" : 17,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 1,
      "fused_tanh" : 0,
      "debug_info" : "conv2d_12",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "conv2d_12__activation___output",
      "blob_weights" : 21,
      "K" : 16,
      "blob_biases" : 19,
      "name" : "conv2d_12",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 8,
      "bottom" : "batch_normalization_11_output",
      "weights" : {

      },
      "Nx" : 5,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 5,
      "n_parallel" : 1
    },
    {
      "name" : "batch_normalization_12",
      "bottom" : "conv2d_12__activation___output",
      "weights" : {

      },
      "debug_info" : "batch_normalization_12",
      "top" : "batch_normalization_12_output",
      "C" : 8,
      "blob_batchnorm_params" : 23,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "refinement_pred",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "refinement_pred_output",
      "blob_weights" : 27,
      "K" : 8,
      "blob_biases" : 25,
      "name" : "refinement_pred",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1,
      "bottom" : "batch_normalization_12_output",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 1,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "refinement_pred_output",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "refinement_pred__activation__",
      "top" : "output1",
      "type" : "activation",
      "name" : "refinement_pred__activation__",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}